# A = int(input("введите число"))
# B = int(input("введите число"))
# C = int(input("введите число"))
# D = int(input("введите число"))
# if A = 0
#     print("Ноль не подходит")
# if B = 0
#     print("Ноль не подходит")
# if C = 0
#     print("Ноль не подходит")

# mid_num = (A + B + C + D)/4
# print(round(mid_num,2))

# kol = 0 

# a = int(input("введите число "))
# kol = kol + 1

# sum = 0

# while a !=0:
#     print("вы ввели" kol "чисел")
#     sum = sum + a
#     print("сумма чисел равна",sum)
#     print("цикл продолжается")
#     a = int(input("Введите число A "))
#     kol = kol + 1   
 
# буква = input("Введи любую латинскую букву ")
# if буква.lower() in ['a','e','i','o','u']:
#     print("Это гласная буква")
# elif буква.lower() == 'y':
#     print("Это буква может быть гласной и согласной")
# else:
#     print("это согласная буква")

# kordi = input("Введите координаты клетки")
# if kordi() in ['a1','a3','a5','a7','b2','b4','b6','b8','c1','c3','c5','c7','d2','d4','d6','d8','e1','e3','e5','e7','f2','f4','f6','f8','g1','g3','g5','g7','h2','h4','h6','h8']:
#     print("Клетка с этой координатой черная")
# if kordi() in ['a2','a4','a6','a8','b1','b3','b5','b7','c2','c4','c6','c8','d1','d3','d5','d7','e2','e4','e6','e8','f1','f3','f5','f7','g2','g4','g6','g8','h1','h3','h5','h7']:
#     print("Клетка с этой координатой белая")

# coordinate = input("введите координату ")
# буква = coordinate[0]
# цифра = int(coordinate[1])

# if цифра % 2 == 0 and (буква == "b" or буква == "d" or буква == "f" or буква == "h") :
#     print("черное")
# elif цифра % 2 == 0 and (буква == "a" or буква == "c" or буква == "e" or буква == "g"):
#      print("белое")
# else:
#      print("черное")

num = 8165489
count = 0

for i in range(2,121):
    if (num % i == 0):
        print(f"число {num} составное.\nОно делится на {i}")
        count += 1
if (count>0):
    print(f"число {num} составное")
else:
    print(f"число {num} простое")
